module.vpc.aws_kms_key.vpc_flow_logs: Refreshing state... [id=347137e7-8489-4dd5-8ff0-561bac764438]
module.vpc.aws_iam_role.flow_logs_role: Refreshing state... [id=vpc-flow-logs-role]
module.rds.aws_kms_key.rds_performance_insights: Refreshing state... [id=c7a90af2-b80a-47f5-817d-76ef08929a64]
module.vpc.aws_cloudwatch_log_group.flow_logs: Refreshing state... [id=/aws/vpc/flow-logs]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Reading...
module.ecs_cluster.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:cluster/cerepx-dev-cluster]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-029a6cd1da94ed29e]
module.ecs_service.data.aws_iam_policy_document.execution_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.data.aws_iam_policy_document.task_assume_role: Read complete after 0s [id=1077804475]
module.ecs_service.aws_iam_role.task_role: Refreshing state... [id=hello-birthday-api-service-task]
module.vpc.aws_iam_role_policy.flow_logs_policy: Refreshing state... [id=vpc-flow-logs-role:vpc-flow-logs-policy]
module.vpc.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/flowlogs/hello-birthday-dev]
module.vpc.aws_route_table.private: Refreshing state... [id=rtb-01c87601e22172550]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ca998b2f809f036c]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b360bbebcaa480e5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ddb2b3fdf159574c]
module.vpc.aws_security_group.ecs: Refreshing state... [id=sg-0ae81af3f721e51a4]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-07832cfb87db1c4c3]
module.vpc.aws_flow_log.vpc_flow_logs: Refreshing state... [id=fl-0f0309c1f8f7d983e]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/ff3bf51d7d8836f7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b4f96a4a08eb4a5b]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0116a9ef8764923a8]
module.vpc.aws_security_group.rds: Refreshing state... [id=sg-0622864b918d283ed]
module.vpc.aws_route.default_internet_access: Refreshing state... [id=r-rtb-0b360bbebcaa480e51080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-08047ccfb754ab73d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f88590ccfac5c504]
module.rds.aws_db_subnet_group.this: Refreshing state... [id=hello-birthday-dev-subnet-group]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bc26398f249d5dad]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-000b959cb9c8c17b6]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/e814949fb203c902]
module.rds.aws_db_instance.this: Refreshing state... [id=db-MNYKAUQQ3O3OCCMOP5A35SVKSM]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.alb.aws_lb.this has been deleted
  - resource "aws_lb" "this" {
      - arn                                                          = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1" -> null
      - dns_name                                                     = "hello-birthday-api-alb-2043744332.eu-west-1.elb.amazonaws.com" -> null
        id                                                           = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:loadbalancer/app/hello-birthday-api-alb/cc875576fdfa60e1"
        name                                                         = "hello-birthday-api-alb"
        tags                                                         = {}
      - zone_id                                                      = "Z32O12XQLNTSW2" -> null
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.alb.aws_lb_listener.http has been deleted
  - resource "aws_lb_listener" "http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/e814949fb203c902" -> null
        id                                                                  = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:listener/app/hello-birthday-api-alb/cc875576fdfa60e1/e814949fb203c902"
        tags                                                                = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_target_group.this has been deleted
  - resource "aws_lb_target_group" "this" {
      - arn                                = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/ff3bf51d7d8836f7" -> null
        id                                 = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/ff3bf51d7d8836f7"
        name                               = "hello-birthday-api-tg"
        tags                               = {}
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.alb.aws_lb.this will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "hello-birthday-api-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0116a9ef8764923a8",
          + "subnet-0b4f96a4a08eb4a5b",
        ]
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = (known after apply)
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # module.alb.aws_lb_target_group.this will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "hello-birthday-api-tg"
      + name_prefix                        = (known after apply)
      + port                               = 5050
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-029a6cd1da94ed29e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_api.api will be created
  + resource "aws_apigatewayv2_api" "api" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + ip_address_type              = (known after apply)
      + name                         = "hello-birthday-api-gateway"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_integration.alb_integration will be created
  + resource "aws_apigatewayv2_integration" "alb_integration" {
      + api_id                                    = (known after apply)
      + connection_id                             = (known after apply)
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.default_route will be created
  + resource "aws_apigatewayv2_route" "default_route" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default_stage will be created
  + resource "aws_apigatewayv2_stage" "default_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_vpc_link.api_vpc_link will be created
  + resource "aws_apigatewayv2_vpc_link" "api_vpc_link" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "hello-birthday-vpc-link"
      + security_group_ids = (known after apply)
      + subnet_ids         = [
          + "subnet-0ca998b2f809f036c",
          + "subnet-0ddb2b3fdf159574c",
        ]
      + tags_all           = (known after apply)
    }

  # module.ecs_service.aws_cloudwatch_log_group.ecs_logs will be created
  + resource "aws_cloudwatch_log_group" "ecs_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/hello-birthday-api-service"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
        }
      + tags_all          = {
          + "Environment" = "dev"
        }
    }

  # module.ecs_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:456212641044:service/cerepx-dev-cluster/hello-birthday-api-service"
        name                               = "hello-birthday-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:456212641044:task-definition/hello-birthday-api-service:7" -> (known after apply)
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "hello-birthday-api" -> null
          - container_port   = 5050 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:456212641044:targetgroup/hello-birthday-api-tg/ff3bf51d7d8836f7" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "hello-birthday-api"
          + container_port   = 5050
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "GUNICORN_WORKERS"
                          + value = "2"
                        },
                      + {
                          + name  = "MYSQL_HOST"
                          + value = "hello-birthday-dev-db.claz3uxrx5pl.eu-west-1.rds.amazonaws.com:3306"
                        },
                      + {
                          + name  = "MYSQL_PASSWORD"
                          + value = "devpassword123"
                        },
                      + {
                          + name  = "MYSQL_USER"
                          + value = "devadmin"
                        },
                    ]
                  + image            = "456212641044.dkr.ecr.eu-west-1.amazonaws.com/hello-birthday-api:1.0.26"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/hello-birthday-api-service"
                          + awslogs-region        = "eu-west-1"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "hello-birthday-api"
                  + portMappings     = [
                      + {
                          + containerPort = 5050
                          + hostPort      = 5050
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "hello-birthday-api-service"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::456212641044:role/hello-birthday-api-service-task"
      + track_latest             = false
    }

  # module.ecs_service.aws_iam_role.ecs_task_execution_role will be created
  + resource "aws_iam_role" "ecs_task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hello-birthday-api-service-exec"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-api-service-exec"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-api-service-exec"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ecs_service.aws_iam_role.task_role will be updated in-place
  ~ resource "aws_iam_role" "task_role" {
        id                    = "hello-birthday-api-service-task"
        name                  = "hello-birthday-api-service-task"
      ~ tags                  = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-api-service-task"
        }
      ~ tags_all              = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-api-service-task"
        }
        # (11 unchanged attributes hidden)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.ecs_task_execution_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution_role_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "hello-birthday-api-service-exec"
    }

  # module.vpc.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for the Application Load Balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "hello-birthday-dev-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-dev-alb-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-dev-alb-sg"
        }
      + vpc_id                 = "vpc-029a6cd1da94ed29e"
    }

  # module.vpc.aws_security_group.ecs will be updated in-place
  ~ resource "aws_security_group" "ecs" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.10.0.0/16",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
        id                     = "sg-0ae81af3f721e51a4"
        name                   = "hello-birthday-dev-ecs-sg"
        tags                   = {
            "Environment" = "dev"
            "Name"        = "hello-birthday-dev-ecs-sg"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC Interface Endpoints"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.10.0.0/16",
                ]
              + description      = "Allow HTTPS (443) from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "hello-birthday-dev-vpc-endpoints-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-dev-vpc-endpoints-sg"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "hello-birthday-dev-vpc-endpoints-sg"
        }
      + vpc_id                 = "vpc-029a6cd1da94ed29e"
    }

  # module.vpc.aws_vpc_endpoint.cloudwatch_logs will be created
  + resource "aws_vpc_endpoint" "cloudwatch_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0ca998b2f809f036c",
          + "subnet-0ddb2b3fdf159574c",
        ]
      + tags                  = {
          + "Name" = "hello-birthday-dev-cw-endpoint"
        }
      + tags_all              = {
          + "Name" = "hello-birthday-dev-cw-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-029a6cd1da94ed29e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0ca998b2f809f036c",
          + "subnet-0ddb2b3fdf159574c",
        ]
      + tags                  = {
          + "Name" = "hello-birthday-dev-ecr-api-endpoint"
        }
      + tags_all              = {
          + "Name" = "hello-birthday-dev-ecr-api-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-029a6cd1da94ed29e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0ca998b2f809f036c",
          + "subnet-0ddb2b3fdf159574c",
        ]
      + tags                  = {
          + "Name" = "hello-birthday-dev-ecr-dkr-endpoint"
        }
      + tags_all              = {
          + "Name" = "hello-birthday-dev-ecr-dkr-endpoint"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-029a6cd1da94ed29e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.vpc.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-01c87601e22172550",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.eu-west-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "hello-birthday-dev-s3-endpoint"
        }
      + tags_all              = {
          + "Name" = "hello-birthday-dev-s3-endpoint"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-029a6cd1da94ed29e"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 18 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

<!-- Sticky Pull Request Commentterraform-plan -->